# 1. 输出1-100
# 计数器
# 1. 控制循环次数
# 2. 参与运算
"""
i = 1
while i < 101:
    print(i)
    i += 1
"""
# 2. 输出1-100的和   1 + 2 + 3 ... 100
"""
i = 1
sum = 0  # 初始化统计结果变量
while i < 6:
    sum += i
    i += 1

print(sum)
"""
# 3. 输出1-100之间的偶数  2 4 6 7 8 ... 100
"""
# 第一种
i = 2
while i < 101:
    print(i)
    i += 2
"""

"""
# 第二种
i = 1
while i < 101:
    if i % 2 == 0:
        print(i)
    i += 1
"""

# 4. 输出1-100之间的奇数和 1 + 3 + 5 + ... 99
i = 1
sum = 0
while i < 100:
    if i % 2 != 0:
        sum += i
    i += 1

print(sum)
